/*
Това е набор от функции за работа с контроли за раздел.
Не трябва да се променя контролата за раздел, когато се ползват
тези функции, защото функциите поемат определени условия и
могат да предизвикат неопределно поведение.
*/

#ifndef TABS_H
#define TABS_H

/*
int AddTab(HWND TabWindow, HWND Window, char * Caption, int Index)

Добавя раздел към контролата за раздел и го свързва прозореца за него.
Прозореца се премества и оразмерява за да се събере в димензиите на раздела.

Параметри:
	TabWindow - Дръжка на контролата за раздели
	Window    - Дръжка на подпрозореца, който е свързан за контролата
	Caption   - Низа съдържаща заглавието на раздела
	Index     - Индекс на новия раздел (Индексите започват от 0)
				Ако е индекса е -1, раздела се добавя накрая от контролата

Стойност при завръщане:
	Връща го новия индекс или -1 за грешка
*/
int AddTab(HWND TabWindow, HWND Window, char * Caption, int Index);

/*
int TabToFront(HWND TabWindow, int Index)

Избира го определения раздел и го показва подходящия прозорец.

Параметри:
	TabWindow - Дръжка на контролата за раздели
	Index     - Индекс на раздела, който ще се показва
				Ако индекса е -1, показва се текущо избрания подпрозорец

Стойност при завърщане:
	Връща го индекса на избрания раздел или -1 за грешка.
*/
int TabToFront(HWND TabWindow, int Index);

/*
BOOL TabCleanup(HWND TabWindow)

Изтрива ги всички раздели от контролера.
Изчиства ги вътрешните ресурси и скрива ги всички прозорци
свързани с контролата за раздели.

Препорачително е да се извиква тази функция преди контролата за раздел
се унищожи, например в WM_CLOSE съобщението.

Параметри:
	TabWindow - Дръжка на контролата за раздели

Стойност при завърщане:
	Връща true ако няма грешка.
*/
BOOL TabCleanup(HWND TabWindow);

#endif
